import { useState } from "react";
import "./Vovio.css";
import Button from "./Button";

function Vovio({ mode = "light" }) {
  const [isEnglish, setIsEnglish] = useState(false);

  const language = isEnglish ? "English" : "Konkani";

  function chnageLanguageHandler() {
    setIsEnglish((prevState) => !prevState);
  }

  const konkaniVovio = (
    <>
      <p>
        ಅಪ್ರೊಸಾಚ್ಯೆ ಬೊಸಿಯೆ ಬಾಂಗಾರಾಚೊ ಭೊಂವೊರ್ ರೊಸಾಕ್ ಬಸ್ಲಾ ಕುವೊರ್ ಆಮ್ಚೊ
        ಹೊರೆತ್‌ಬಾಬ್ ಜಾಪ್: ವೊವೆ ಭೊಂವೊರ್ | ರೊಸಾಕ್ ಬಸ್ಲಾ ಕುವೊರ್ ಆಮ್ಚೊ ಹೊರೆತ್‌ಬಾಬ್
      </p>

      <p>
        ಅಪ್ರೊಸ್ಚ್ ಕಾಡ್ನ್ ದವರಿಲಾ ಬಾಂಕಾ ಪಯ್ಲೊ ಮಾನ್ ತುಕಾ ಸರ್ಗಿಂಚ್ಯಾ ದೆವಾ ಬಾಪಾ ಜಾಪ್
        : ವೊವೇ ಬಾಂಕಾ | ಪಯ್ಲೊ ಮಾನ್ ತುಕಾ ಸರ್ಗಿಂಚ್ಯಾ ದೆವಾ ಬಾಪಾ
      </p>

      <p>
        ರೋಸ್ಚ್ ಕಾಡ್ಲಾ ದೆಡಾ ಕಾಂಡಿಯೆಚೊ ಉಬೆ ರಾವೊನ್ ಚೊಯ್ತಾ ಪೂತ್ ಮರಿಯೆಚೊ ಜಾಪ್: ವೊವೇ
        ಕಾಂಡಿಯೆಚೊ | ಉಬೆ ರಾವೊನ್ ಚೊಯ್ತಾ ಪೂತ್ ಮರಿಯೆಚೊ
      </p>

      <p>
        ದೆವಾ ಬಾಪಾ ದೆವಾ ಪುತಾ ದೆವಾ ಸ್ಪಿರಿತ್ ಸಾಂತಾ ಕುರ‍್ಪೆಚ್ಯಾ ದಿಸಾ ಯೆಜ್ಮಾನ್ ರೋಸ್
        ಲಾಯ್ತಾ ಜಾಪ್: ವೊವೆ ಸಾಂತಾ | ಕುರ‍್ಪೆಚ್ಯಾ ದಿಸಾ ಯೆಜ್ಮಾನ್ ರೋಸ್ ಲಾಯ್ತಾ
      </p>

      <p>
        ಕಾನಿಂ ಘಾಲೆಂ ತೇಲ್ ಮ್ಹಣೊನ್ ಕಪೊಲಿಂ ಕಾಡ್ಲೊ ಖುರಿಸ್ ವಯ್ಕುಂಟಿಚೊ ಜೆಜು ಕ್ರೀಸ್ತ್
        ಹೊರೆತಾಕ್ ಬೆಸಾಂವ್ ದೀಂವ್ ಜಾಪ್ : ವೊವೇ ಖುರಿಸ್ | ವಯ್ಕುಂಟಿಚೊ ಜೆಜು ಕ್ರೀಸ್ತ್
        ಹೊರೆತಾಕ್ ಬೆಸಾಂವ್ ದೀಂವ್
      </p>

      <p>
        ನಾರ‍್ಲೆಲಾ ವರ‍್ನಿಂ ತಿಳೆಲ್ ಮೆಲ್ ಹೊರೆತಾರೆ ಬಾಬಾ ಕಾನಿಂ ತೇಲ್ ಜಾಪ್: ವೊವೆ ಮೆಲ್ |
        ಹೊರೆತಾರೆ ಬಾಬಾ ಕಾನಿಂ ತೇಲ್
      </p>

      <p>
        ಕಾನಿ ತಾಳ್ವೆ ತೇಲ್ ಘಾಲ್ನ್ ಬಸಯಿಲಾ ಬಾಂಕಾ ಪಯ್ಲೊ ಮಾನ್ ತುಕಾ ಸರ್ಗಿಂಚ್ಯಾ ದೆವಾ
        ಬಾಪಾ ಜಾಪ್: ವೊವೇ ಬಾಂಕಾ | ಪಯ್ಲೊ ಮಾನ್ ತುಕಾ ಸರ್ಗಿಂಚ್ಯಾ ದೆವಾ ಬಾಪಾ
      </p>

      <p>
        ಕಾನಿ ತಾಳ್ವೆಕ್ ತೇಲ್ ಘಾಲ್ನ್ ಜೆಜುಕ್ ಮಾರ್ಲೊ ಉಲೊ ಮಾಯ್ಪಾಸಾಚೊ ಚಲೊ, ಆಮ್ಚೊ ಹೊರೆತ್
        ಬಾಬ್ ಜಾಪ್: ವೊವೇ ಉಲೊ | ಮಾಯ್ಪಾಸಾಚೊ ಚಲೊ, ಆಮ್ಚೊ ಹೊರೆತ್ ಬಾಬ್
      </p>

      <p>
        ಆಪ್ರೊಸಾಚಿ ಬೊಶಿ ದಾವಿಗೀ ಉಜ್ವಿ ಪಯ್ಲೊ ರೋಸ್ ಪುಸ್ತಾ ಹೊರೆತಾ ಆವಯ್ ತುಜಿ ಜಾಪ್:
        ವೊವೆ ಉಜ್ವಿ | ಪಯ್ಲೆ ರೋಸ್ ಪುಸ್ತಾ ಹೊರೆತಾ ಆವಯ್ ತುಜಿ
      </p>

      <p>
        ನಂಡೆನ್ ಘಾಲಾಂ ಲೊಣ್ಚೆಂ ಜಾವ್ ಘಾಲ್ತಾ ದೊಸ್ ಆವಯ್ ಪುಸ್ತಾ ರೊಸ್ ಹೊರೆತಾ ನೀಟ್ ಬಸ್
        ಜಾಪ್: ವೊವೆ ದೊಸ್ | ಆವಯ್ ಪುಸ್ತಾ ರೊಸ್ ಹೊರೆತಾ ನೀಟ್ ಬಸ್
      </p>

      <p>
        ಆಪ್ರೊಸಾಚ್ಯೆ ವಾಟ್ಲೆ ಮೊತಿಯಾಂಚೊ ಘೊಸ್ ಮೊಗಾಚೊ ರೋಸ್ ಹೊರೆತಾ ಬಾಪಾಯ್ಚೊ ತುಜ್ಯಾ
        ಜಾಪ್: ವೊವೆ ಫೊಸ್ | ಮೊಗಾಚೊ ರೋಸ್ ಹೊರೆತಾ ಬಾಪಾಯ್ಚೊ ತುಜ್ಯಾ
      </p>

      <p>
        ಕಾಶ್ಯಾಚೆ ವಾಟ್ಲೆ ಭಾಂಗಾರಾಚೊ ಕೇಸ್ ಮಯ್ಪಾಸಾಚೊ ರೋಸ್ ಹೊರೆತಾ ಭಯ್ಣ್ವಾಂಚೊ। ‌‌
        ಜಾಪ್: ವೊವೆ ಕೇಸ್ | ಮಯ್ಪಾಸಾಚೊ ರೋಸ್ ಹೊರೆತಾ ಭಯ್ಣ್ವಾಂಚೊ
      </p>

      <p>
        ಆಮ್ಸಾಣ್ ಮಿರ್ಸಾಂಗ್ ವಾಟುಂಕ್ ವಾನ್ ದೊಡೊ ದೀ ಮಾನ್ ಹೊರೆತಾ ಆಕಯ್ಕ್ ತುಜ್ಯಾ ಜಾಪ್:
        ವೊವೆ ವಾನ್ | ದೊಡೊ ದೀ ಮಾನ್ ಹೊರೆತಾ ಆಕಯ್ಕ್ ತುಜ್ಯಾ
      </p>

      <p>
        ಬಾತಾಚ್ಯಾ ರಾಶಿರ್ ಬಸೊನ್ ಆಸಾ ಕಾವ್ಳೊ ಮುಂಡಾಸ್ಗಾರ್ ಮಾವ್ಳೊ ಆತಾಂ ರೋಸ್ ಲಾಯ್ತಾ
        ಜಾಪ್: ವೊವೆ ಕಾವ್ಳೊ ಮುಂಡಾಸ್ಗಾರ್ ಮಾವ್ಳೊ ಆತಾಂ ರೋಸ್ ಲಾಯ್ತಾ
      </p>

      <p>
        ಮಾವ್ಶೆಚ್ಯಾ ಕೆಸಾಂಕ್ ಗುಲೊಬಾಚೊ ಘೊಸ್ ಮಾವ್ಶಿ ಪುಸ್ತಾ ರೋಸ್ ವೊರೆತಾ ನೀಟ್ ಬಸ್
        ಜಾಪ್: ವೊವೆ ಘೊಸ್ | ಮಾವ್ಶಿ ಪುಸ್ತಾ ರೋಸ್ ಹೊರೆತಾ ನೀಟ್ ಬಸ್
      </p>

      <p>
        ಮುಕಾರ್ ಕಿತ್ಯಾಕ್ ಉಡ್ಡಾತಾತ್ ಪಾಟ್ಲ್ಯಾನ್ ಬಸಾ ಆಯಿಲ್ಲೆ ವೊವ್ಳೆ ಸಕ್ಕಡ್ ರೋಸ್
        ಪುಸುನ್ ವಚಾ ಜಾಪ್: ವೊವೆ ಬಸಾ | ಆಯಿಲ್ಲೆ ವೊವ್ಳೆ ಸಕ್ಕಡ್ ರೋಸ್ ಪುಸುನ್ ವಚಾ
      </p>

      <p>
        ಆಮ್ಚ್ಯಾ ಹಿತ್ಲಾಂತ್ ಉಡೊನ್ ಗೆಲೊ ಸೊಸೊ ಉತ್ರಾಂ ಫುಡೆಂ ಹಾಸೊ ಆಮ್ಚ್ಯಾ ಹೊರೆತಾಕ್
        ಜಾಪ್: ವೊವೆ ಸೊಸೊ | ಉತ್ರಾಂ ಫುಡೆಂ ಹಾಸೊ ಆಮ್ಚ್ಯಾ ಹೊರೆತಾಕ್
      </p>

      <p>
        ಕಾನಾಂಕ್ ಲಾಯ್ಲೆಂ ವೊಕ್ಲ್ ದೊಳ್ಯಾಂಕ್ ಆಯ್ಲಿ ದೀಷ್ಟ್ ಗಾಂವ್ ಸಗ್ಳೊ ಈಷ್ಟ್ ಆಮ್ಚ್ಯಾ
        ವೊರೆತಾಕ್ ಜಾಪ್: ವೊವೆ ದೀಷ್ಟ್ | ಗಾಂವ್ ಸಗ್ಳೊ ಈಷ್ಟ್ ಆಮ್ಚ್ಯಾ ವೊರೆತಾಕ್
      </p>

      <p>
        ತುಳ್ವ್ಯಾ ಭಾಷೆತ್ ಮಿರ‍್ಸಾಂಗೆಕ್ ಮ್ಹಣ್ತಾತ್ ಮುಂಚಿ ಗುಣಾಂನಿ ಉಂಚಿ ಆಮ್ಚೊ
        ಹೊರೆತ್‌ಬಾಬ್ ಜಾಪ್: ವೊವೆ ಮುಂಚಿ | ಗುಣಾಂನಿ ಉಂಚಿ ಆಮ್ಚೊ ಹೊರೆತ್‌ಬಾಬ್
      </p>

      <p>
        ಮುಗ್‌ಚ್ ಕಾಂಡುನ್ ಮುಗಾಚಿ ಕೆಲಿ ದಾಳ್ ಕುಟ್ಮಾಂತ್ ಮೊಗಾಳ್ ಆಮ್ಚೊ ಹೊರೆತ್‌ಬಾಬ್
        ಜಾಪ್: ವೊವೆ ದಾಳ್ | ಕುಟ್ಮಾಂತ್ ಮೊಗಾಳ್ ಹೊರೆತ್‌ಬಾಬ್
      </p>

      <p>
        ರುಕಾ ವಯ್ಲೊ ಪಿಂಪೊಳ್ ಪಾನಾಂನಿ ಪಾತಳ್ ಉತರ್ ನಿತಳ್ ಆಮ್ಚ್ಯಾ ಹೊರೆತಾಚೆಂ ಜಾಪ್: ವೊವೆ
        ಪಾತಳ್ | ಉತರ್ ನಿತಳ್ ಆಮ್ಚ್ಯಾ ಹೊರೆತಾಚೆಂ
      </p>

      <p>
        ರೊಶ್ಯಾಚೆ ರಾಂದ್ಣಿ ಕಟ್ಟ್ಯಾಂಚೊ ಫೊಗ್ ವಿಸ್ರೊನಾಕಾ ಮೋಗ್ ತುಜ್ಯಾ ಆವಯ್ಚೊ ಜಾಪ್:
        ವೊವೆ ಫೊಗ್ | ವಿಸ್ರೊನಾಕಾ ಮೋಗ್ ತುಜ್ಯೆ ಆವಯ್ಚೊ
      </p>

      <p>
        ಪಾಣೆರ್ ಪೇಂಟೆಂತ್ ವಿಕುಂಕ್ ಘಾಲಾಂ ಜಿರೆಂ ಸಕ್ಕಡ್ ಆಯ್ಲಾಂ ಬಿರೆಂ ಹೊರೆತಾ ಕುಟಮ್
        ತುಜೆಂ ಜಾಪ್ : ವೊವೆ ಜಿರೆಂ | ಸಕ್ಕಡ್ ಆಯ್ಲಾಂ ಬಿರೆಂ ಕುಟಮ್ ತುಜೆಂ
      </p>

      <p>
        ತಾಂಬ್ಯಾಚ್ಯಾ ಭಾಣಿ ತಾಪಯಿಲ್ಲ್ಯಾ ಪಾಣಿ ಹೊರೆತ್ ನ್ಹಾತಾ ನ್ಹಾಣಿ ಆಜ್ ಆಂಕ್ವಾರ‍್ಪಣಿ
        ಜಾಪ್: ವೊವೆ ಪಾಣಿ | ಹೊರೆತ್ ನ್ಹಾತಾ ನ್ಹಾಣಿ ಆಜ್ ಆಂಕ್ವಾರ‍್ಪಣಿ
      </p>

      <p>
        ದರ‍್ಯಾಚ್ಯಾ ಲಾರಾ ಪಾಕಾಂ ಫುಲಯ್ ಮೊರಾ ನ್ಹಾಂವ್ಕ್ ಆಪವ್ನ್ ವರಾ ಆಮ್ಚ್ಯಾ ಹೊರೆತಾಕ್
        ಜಾಪ್: ವೊವೆ ಮೊರಾ | ನ್ಹಾಂವ್ಕ್ ಆಪವ್ನ್ ವ್ಹರಾ ಆಮ್ಚ್ಯಾ ಹೊರೆತಾಕ್
      </p>

      <p>
        ದೆಳೆಂ ಚಡೊನ್ ವಾಲಿಂತ್ಲಿಂ ಪಾನಾಂ ತುಟಯಾ ಹಾತ್ ದೀವ್ನ್ ಉಟಯಾ ಆಮ್ಚ್ಯಾ ಹೊರೆತಾಕ್
        ಜಾಪ್: ವೊವೆ ತುಟಯಾ | ಹಾತ್ ದೀವ್ನ್ ಉಟಯಾ ಆಮ್ಚ್ಯಾ ಹೊರೆತಾಕ್
      </p>

      <p>
        ಮಾಡಿಯೆಚಿ ಕಾಂಬ್ ಬಾರಿಕ್ ತಾಸ್ಯಾ ಘಟ್ಟ್ ಧರ‍್ನ್ ಘಾಸ್ಯಾ ಆಮ್ಚ್ಯಾ ಹೊರೆತಾಕ್ ಜಾಪ್:
        ವೊವೆ ತಾಸ್ಯಾ | ಘಟ್ಟ್ ಧರ‍್ನ್ ಘಾಸ್ಯಾ ಆಮ್ಚ್ಯಾ ಹೊರೆತಾಕ್
      </p>
    </>
  );

  const englishVovio = <>english vovios is comming soon....</>;

  return (
    <>
      <div className={`vovio vovio-${mode}`}>
        <div className="title">
          <h1>Konkani vovios ({language})</h1>
          <Button onClick={chnageLanguageHandler}>
            {isEnglish ? "Konkani" : "English"}
          </Button>
        </div>
        {isEnglish ? englishVovio : konkaniVovio}
      </div>
    </>
  );
}

export default Vovio;
